Parameters:
covn_filter_0= 40
covn_kernel_0= 13
covn_filter_1= 30
covn_kernel_1= 11
covn_filter_2= 20
covn_kernel_2= 9
covn_filter_3= 20
covn_kernel_3= 7
covn_filter_4= 10
covn_kernel_4= 5
unit_1= 40
unit_2= 20

  #Dense blocks
  x = keras.layers.Dense(units=unit_1,activation='elu')(x)
  x = keras.layers.Dropout(0.5)(x)
  x = keras.layers.Dense(units=unit_2,activation='elu')(x)

  #Output
  output_cnn = keras.layers.Dense(units=1, activation='sigmoid', bias_initializer=output_bias)(x)
  model = keras.Model(inputs=[inputs], outputs = [output_cnn])

  OPTI = tf.keras.optimizers.Nadam(learning_rate=0.0001)
  model.compile(optimizer=OPTI,
              loss="binary_crossentropy",
              metrics=metrics)

Summary:
Model: "model_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_7 (InputLayer)         [(None, 80, 80, 1)]       0         
_________________________________________________________________
conv2d_52 (Conv2D)           (None, 80, 80, 40)        6800      
_________________________________________________________________
max_pooling2d_32 (MaxPooling (None, 40, 40, 40)        0         
_________________________________________________________________
target_layer (Conv2D)        (None, 40, 40, 30)        145230    
_________________________________________________________________
batch_normalization_52 (Batc (None, 40, 40, 30)        120       
_________________________________________________________________
conv2d_53 (Conv2D)           (None, 40, 40, 30)        108930    
_________________________________________________________________
batch_normalization_53 (Batc (None, 40, 40, 30)        120       
_________________________________________________________________
max_pooling2d_33 (MaxPooling (None, 20, 20, 30)        0         
_________________________________________________________________
conv2d_54 (Conv2D)           (None, 20, 20, 20)        48620     
_________________________________________________________________
batch_normalization_54 (Batc (None, 20, 20, 20)        80        
_________________________________________________________________
conv2d_55 (Conv2D)           (None, 20, 20, 20)        32420     
_________________________________________________________________
batch_normalization_55 (Batc (None, 20, 20, 20)        80        
_________________________________________________________________
max_pooling2d_34 (MaxPooling (None, 10, 10, 20)        0         
_________________________________________________________________
conv2d_56 (Conv2D)           (None, 10, 10, 20)        19620     
_________________________________________________________________
batch_normalization_56 (Batc (None, 10, 10, 20)        80        
_________________________________________________________________
conv2d_57 (Conv2D)           (None, 10, 10, 20)        19620     
_________________________________________________________________
batch_normalization_57 (Batc (None, 10, 10, 20)        80        
_________________________________________________________________
max_pooling2d_35 (MaxPooling (None, 5, 5, 20)          0         
_________________________________________________________________
conv2d_58 (Conv2D)           (None, 5, 5, 10)          5010      
_________________________________________________________________
batch_normalization_58 (Batc (None, 5, 5, 10)          40        
_________________________________________________________________
conv2d_59 (Conv2D)           (None, 5, 5, 10)          2510      
_________________________________________________________________
batch_normalization_59 (Batc (None, 5, 5, 10)          40        
_________________________________________________________________
max_pooling2d_36 (MaxPooling (None, 2, 2, 10)          0         
_________________________________________________________________
flatten_6 (Flatten)          (None, 40)                0         
_________________________________________________________________
dropout_12 (Dropout)         (None, 40)                0         
_________________________________________________________________
dense_18 (Dense)             (None, 20)                820       
_________________________________________________________________
dropout_13 (Dropout)         (None, 20)                0         
_________________________________________________________________
dense_19 (Dense)             (None, 20)                420       
_________________________________________________________________
dense_20 (Dense)             (None, 1)                 21        
=================================================================
Total params: 390,661
Trainable params: 390,341
Non-trainable params: 320
_________________________________________________________________


Validation:
51/51 [==============================] - 1s 25ms/step - loss: 0.0828 - tp: 126.0000 - fp: 18.0000 - tn: 1453.0000 - fn: 25.0000 - accuracy: 0.9735 - precision: 0.8750 - recall: 0.8344 - auc: 0.9726

Test:
44/44 [==============================] - 2s 23ms/step - loss: 0.0998 - tp: 80.0000 - fp: 5.0000 - tn: 1293.0000 - fn: 30.0000 - accuracy: 0.9751 - precision: 0.9412 - recall: 0.7273 - auc: 0.9413